InformationRegisters/Расценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>Расценки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерТарифнойСтавкиПервогоРазряда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расценка</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТехнологическаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РазмерыПараметровДляРасчетаРБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>РазмерыПараметровДляРасчетаРБ</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПараметра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПараметровДляРасчетаЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТарифныеСтавкиПервогоРазрядаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ТарифныеСтавкиПервогоРазрядаОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяСтавка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыПараметровДляРасчетаЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыПараметровДляРасчетаЗарплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БазоваяВеличина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БазоваяСтавка1разряда</Name>
					<Comment>Ставка первого разряда по РБ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БПМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МинимальнаяЗарплатаРБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧасоваяМинимальнаяЗарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредняяЗП</Name>
					<Comment>Средняя зарплата рабочих и служащих </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредняяЗПРаботников</Name>
					<Comment>Средняя зарплата работников (для ограничения отчислений с ФОТ и БЛ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СреднемесячнаяНормаДней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СреднемесячнаяНормаЧасов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СреднемесячноеКалендДней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоэффициентДляРасчетаОтпуска</Name>
					<Comment>Среднемесячное количество календарных дней в месяце для расчета отпуска</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка1разрядаОрганизации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/Расценки/Ext/RecordSetModule.bsl
Процедура РассчитатьПоСтавкеПервогоРазряда(ДатаРасчета, Организация) Экспорт
	
	СреднеМесячнаяНормаЧасов = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(КонецМесяца(ДатаРасчета), 
																						Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов)).Размер;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("парамПериод", ДатаРасчета);
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	Запрос.УстановитьПараметр("парамПустаяТарифнаяСтвака", Справочники.ТарифныеСтавкиПервогоРазряда.ПустаяСсылка()); 
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасценкиСрезПоследних.ТехнологическаяОперация,
	|	РасценкиСрезПоследних.Организация,
	|	РасценкиСрезПоследних.ТарифнаяСтавкаПервогоРазряда,
	|	РасценкиСрезПоследних.РазмерТарифнойСтавкиПервогоРазряда,
	|	РасценкиСрезПоследних.РазрядЕТС,
	|	ЕСТЬNULL(РасценкиСрезПоследних.КоэффициентЕТС, 1) КАК КоэффициентЕТС,
	|	ЕСТЬNULL(РасценкиСрезПоследних.ПовышенныйКоэффициентЕТС, 1) КАК ПовышенныйКоэффициентЕТС,
	|	ЕСТЬNULL(РасценкиСрезПоследних.ТарифнаяСтавка, 0) КАК ТарифнаяСтавка,
	|	ЕСТЬNULL(РасценкиСрезПоследних.НормаВремени, 0) КАК НормаВремени,
	|	РасценкиСрезПоследних.Расценка,
	|	РасценкиСрезПоследних.Валюта,
	|	РасценкиСрезПоследних.Комментарий
	|ИЗ
	|	РегистрСведений.Расценки.СрезПоследних(&парамПериод, Организация = &парамОрганизация) КАК РасценкиСрезПоследних
	|ГДЕ
	|	РасценкиСрезПоследних.ТарифнаяСтавкаПервогоРазряда <> &парамПустаяТарифнаяСтвака";
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 тогда
		ЭтотОбъект.Очистить();
	КонецЕсли;
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ТарифнаяСтавкаПервогоРазряда) тогда
			РазмерСтавкиПервогоРазряда = ПолучитьРазмерСтавкиПервогоРазряда(Выборка.ТарифнаяСтавкаПервогоРазряда,ДатаРасчета, Организация);
			Если РазмерСтавкиПервогоРазряда.Следующий() тогда
				Запись = ЭтотОбъект.Добавить();
				ЗаполнитьЗначенияСвойств(Запись,Выборка);
				Запись.Период = ДатаРасчета;
				Запись.РазмерТарифнойСтавкиПервогоРазряда =  РазмерСтавкиПервогоРазряда.Размер;
				ТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(Выборка.КоэффициентЕТС*?(Выборка.ПовышенныйКоэффициентЕТС=0,1,Выборка.ПовышенныйКоэффициентЕТС)*РазмерСтавкиПервогоРазряда.Размер/СреднеМесячнаяНормаЧасов, Константы.ВалютаРегламентированногоУчета.Получить());
				Запись.ТарифнаяСтавка = ТарифнаяСтавка;
				Запись.Расценка = ТарифнаяСтавка*Выборка.НормаВремени;
			Иначе
				Сообщить("Не заполнен размер ставки первого разряда для: " + Выборка.ТарифнаяСтавкаПервогоРазряда, СтатусСообщения.Важное);	
			КонецЕсли;
		Иначе
			Сообщить("Не заполнен вид ставки первого разряда для : " + Выборка.ПодразделениеОрганизации +", " + Выборка.Должность, СтатусСообщения.Важное);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьРазмерСтавкиПервогоРазряда(ТарифнаяСтавкаПервогоРазряда,ДатаРасчета, Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("парамСтавка", ТарифнаяСтавкаПервогоРазряда);
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	Запрос.УстановитьПараметр("парамПериод", ДатаРасчета);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТарифныеСтавкиПервогоРазрядаОрганизацийСрезПоследних.Размер
	|ИЗ
	|	РегистрСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.СрезПоследних(
	|			&парамПериод,
	|			Организация = &парамОрганизация
	|				И ТарифнаяСтавка = &парамСтавка) КАК ТарифныеСтавкиПервогоРазрядаОрганизацийСрезПоследних";
	
	Возврат Запрос.Выполнить().Выбрать();
		
КонецФункции
